#-- coding: utf-8 --


#Задание 9
s = str(input('Введите строку:'))
a = str(input('Введите символ:'))
print(s.replace(a, ''))