#-- coding: utf-8 --

#Задание 1
A = int(input('Введите первое число:'))
B = int(input('Введите второе число:'))
for i in range(A - 1, B):
  print(i + 1)