# -- coding: utf-8 --

#Задание4

sum = 0
N = int(input('Введите количество чисел:'))
for i in range(N):
  s = int(input('Введите числа:'))
  sum+=s
print ('Результат:', sum)