#-- coding: utf-8 --


#Задание 8
n = int(input('Введите число n:'))
s = ''
for i in range(1, n+1):
  s += str(i)
  print(s)