#-- coding: utf-8 --

#Задание 1
N = int(input('Введите число N:'))
i = 1
while i <= N:
  print(i ** 2)
  i += 1